Lasttests/k6_work_services_mariadb_tomcat_6000.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: script.js
        output: -

     scenarios: (100.00%) 1 scenario, 6000 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 600000 iterations shared among 6000 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m00.8s), 6000/6000 VUs, 659 complete and 0 interrupted iterations
default   [   0% ] 6000 VUs  00m00.8s/10m0s  000659/600000 shared iters

running (00m01.8s), 6000/6000 VUs, 2946 complete and 0 interrupted iterations
default   [   0% ] 6000 VUs  00m01.8s/10m0s  002946/600000 shared iters

running (00m02.8s), 6000/6000 VUs, 5667 complete and 0 interrupted iterations
default   [   1% ] 6000 VUs  00m02.8s/10m0s  005667/600000 shared iters

running (00m03.8s), 6000/6000 VUs, 9320 complete and 0 interrupted iterations
default   [   2% ] 6000 VUs  00m03.8s/10m0s  009320/600000 shared iters

running (00m04.8s), 6000/6000 VUs, 13345 complete and 0 interrupted iterations
default   [   2% ] 6000 VUs  00m04.8s/10m0s  013345/600000 shared iters

running (00m05.8s), 6000/6000 VUs, 18064 complete and 0 interrupted iterations
default   [   3% ] 6000 VUs  00m05.8s/10m0s  018064/600000 shared iters

running (00m06.8s), 6000/6000 VUs, 23288 complete and 0 interrupted iterations
default   [   4% ] 6000 VUs  00m06.8s/10m0s  023288/600000 shared iters

running (00m07.8s), 6000/6000 VUs, 28026 complete and 0 interrupted iterations
default   [   5% ] 6000 VUs  00m07.8s/10m0s  028026/600000 shared iters

running (00m08.8s), 6000/6000 VUs, 33808 complete and 0 interrupted iterations
default   [   6% ] 6000 VUs  00m08.8s/10m0s  033808/600000 shared iters

running (00m09.8s), 6000/6000 VUs, 39163 complete and 0 interrupted iterations
default   [   7% ] 6000 VUs  00m09.8s/10m0s  039163/600000 shared iters

running (00m10.8s), 6000/6000 VUs, 44708 complete and 0 interrupted iterations
default   [   7% ] 6000 VUs  00m10.8s/10m0s  044708/600000 shared iters

running (00m11.8s), 6000/6000 VUs, 49999 complete and 0 interrupted iterations
default   [   8% ] 6000 VUs  00m11.8s/10m0s  049999/600000 shared iters

running (00m12.8s), 6000/6000 VUs, 56538 complete and 0 interrupted iterations
default   [   9% ] 6000 VUs  00m12.8s/10m0s  056539/600000 shared iters

running (00m13.8s), 6000/6000 VUs, 62165 complete and 0 interrupted iterations
default   [  10% ] 6000 VUs  00m13.8s/10m0s  062165/600000 shared iters

running (00m14.8s), 6000/6000 VUs, 67781 complete and 0 interrupted iterations
default   [  11% ] 6000 VUs  00m14.8s/10m0s  067781/600000 shared iters

running (00m15.8s), 6000/6000 VUs, 73553 complete and 0 interrupted iterations
default   [  12% ] 6000 VUs  00m15.8s/10m0s  073553/600000 shared iters

running (00m16.8s), 6000/6000 VUs, 79699 complete and 0 interrupted iterations
default   [  13% ] 6000 VUs  00m16.8s/10m0s  079699/600000 shared iters

running (00m17.8s), 6000/6000 VUs, 86272 complete and 0 interrupted iterations
default   [  14% ] 6000 VUs  00m17.8s/10m0s  086272/600000 shared iters

running (00m18.8s), 6000/6000 VUs, 92810 complete and 0 interrupted iterations
default   [  15% ] 6000 VUs  00m18.8s/10m0s  092810/600000 shared iters

running (00m19.8s), 6000/6000 VUs, 98596 complete and 0 interrupted iterations
default   [  16% ] 6000 VUs  00m19.8s/10m0s  098598/600000 shared iters

running (00m20.8s), 6000/6000 VUs, 104992 complete and 0 interrupted iterations
default   [  17% ] 6000 VUs  00m20.8s/10m0s  104992/600000 shared iters

running (00m21.8s), 6000/6000 VUs, 111028 complete and 0 interrupted iterations
default   [  19% ] 6000 VUs  00m21.8s/10m0s  111028/600000 shared iters

running (00m22.8s), 6000/6000 VUs, 117308 complete and 0 interrupted iterations
default   [  20% ] 6000 VUs  00m22.8s/10m0s  117308/600000 shared iters

running (00m23.8s), 6000/6000 VUs, 123679 complete and 0 interrupted iterations
default   [  21% ] 6000 VUs  00m23.8s/10m0s  123679/600000 shared iters

running (00m24.8s), 6000/6000 VUs, 129345 complete and 0 interrupted iterations
default   [  22% ] 6000 VUs  00m24.8s/10m0s  129345/600000 shared iters

running (00m25.8s), 6000/6000 VUs, 133961 complete and 0 interrupted iterations
default   [  22% ] 6000 VUs  00m25.8s/10m0s  133962/600000 shared iters

running (00m26.8s), 6000/6000 VUs, 139943 complete and 0 interrupted iterations
default   [  23% ] 6000 VUs  00m26.8s/10m0s  139943/600000 shared iters

running (00m27.8s), 6000/6000 VUs, 145859 complete and 0 interrupted iterations
default   [  24% ] 6000 VUs  00m27.8s/10m0s  145859/600000 shared iters

running (00m28.8s), 6000/6000 VUs, 152331 complete and 0 interrupted iterations
default   [  25% ] 6000 VUs  00m28.8s/10m0s  152331/600000 shared iters

running (00m29.8s), 6000/6000 VUs, 158633 complete and 0 interrupted iterations
default   [  26% ] 6000 VUs  00m29.8s/10m0s  158633/600000 shared iters

running (00m30.8s), 6000/6000 VUs, 164758 complete and 0 interrupted iterations
default   [  27% ] 6000 VUs  00m30.8s/10m0s  164758/600000 shared iters

running (00m31.8s), 6000/6000 VUs, 170877 complete and 0 interrupted iterations
default   [  28% ] 6000 VUs  00m31.8s/10m0s  170877/600000 shared iters

running (00m32.8s), 6000/6000 VUs, 176875 complete and 0 interrupted iterations
default   [  29% ] 6000 VUs  00m32.8s/10m0s  176875/600000 shared iters

running (00m33.8s), 6000/6000 VUs, 181736 complete and 0 interrupted iterations
default   [  30% ] 6000 VUs  00m33.8s/10m0s  181736/600000 shared iters

running (00m34.8s), 6000/6000 VUs, 186897 complete and 0 interrupted iterations
default   [  31% ] 6000 VUs  00m34.8s/10m0s  186897/600000 shared iters

running (00m35.8s), 6000/6000 VUs, 191736 complete and 0 interrupted iterations
default   [  32% ] 6000 VUs  00m35.8s/10m0s  191736/600000 shared iters

running (00m36.8s), 6000/6000 VUs, 198125 complete and 0 interrupted iterations
default   [  33% ] 6000 VUs  00m36.8s/10m0s  198125/600000 shared iters

running (00m37.8s), 6000/6000 VUs, 204542 complete and 0 interrupted iterations
default   [  34% ] 6000 VUs  00m37.8s/10m0s  204542/600000 shared iters

running (00m38.8s), 6000/6000 VUs, 210873 complete and 0 interrupted iterations
default   [  35% ] 6000 VUs  00m38.8s/10m0s  210873/600000 shared iters

running (00m39.8s), 6000/6000 VUs, 217657 complete and 0 interrupted iterations
default   [  36% ] 6000 VUs  00m39.8s/10m0s  217657/600000 shared iters

running (00m40.8s), 6000/6000 VUs, 224304 complete and 0 interrupted iterations
default   [  37% ] 6000 VUs  00m40.8s/10m0s  224304/600000 shared iters

running (00m41.8s), 6000/6000 VUs, 230210 complete and 0 interrupted iterations
default   [  38% ] 6000 VUs  00m41.8s/10m0s  230210/600000 shared iters

running (00m42.8s), 6000/6000 VUs, 235611 complete and 0 interrupted iterations
default   [  39% ] 6000 VUs  00m42.8s/10m0s  235611/600000 shared iters

running (00m43.8s), 6000/6000 VUs, 241722 complete and 0 interrupted iterations
default   [  40% ] 6000 VUs  00m43.8s/10m0s  241722/600000 shared iters

running (00m44.8s), 6000/6000 VUs, 247598 complete and 0 interrupted iterations
default   [  41% ] 6000 VUs  00m44.8s/10m0s  247598/600000 shared iters

running (00m45.8s), 6000/6000 VUs, 254071 complete and 0 interrupted iterations
default   [  42% ] 6000 VUs  00m45.8s/10m0s  254071/600000 shared iters

running (00m46.8s), 6000/6000 VUs, 258136 complete and 0 interrupted iterations
default   [  43% ] 6000 VUs  00m46.8s/10m0s  258136/600000 shared iters

running (00m47.8s), 6000/6000 VUs, 262931 complete and 0 interrupted iterations
default   [  44% ] 6000 VUs  00m47.8s/10m0s  262931/600000 shared iters

running (00m48.8s), 6000/6000 VUs, 268416 complete and 0 interrupted iterations
default   [  45% ] 6000 VUs  00m48.8s/10m0s  268416/600000 shared iters

running (00m49.8s), 6000/6000 VUs, 272835 complete and 0 interrupted iterations
default   [  45% ] 6000 VUs  00m49.8s/10m0s  272835/600000 shared iters

running (00m50.8s), 6000/6000 VUs, 279170 complete and 0 interrupted iterations
default   [  47% ] 6000 VUs  00m50.8s/10m0s  279170/600000 shared iters

running (00m51.8s), 6000/6000 VUs, 284947 complete and 0 interrupted iterations
default   [  47% ] 6000 VUs  00m51.8s/10m0s  284947/600000 shared iters

running (00m52.8s), 6000/6000 VUs, 289614 complete and 0 interrupted iterations
default   [  48% ] 6000 VUs  00m52.8s/10m0s  289614/600000 shared iters

running (00m53.8s), 6000/6000 VUs, 296030 complete and 0 interrupted iterations
default   [  49% ] 6000 VUs  00m53.8s/10m0s  296030/600000 shared iters

running (00m54.8s), 6000/6000 VUs, 301707 complete and 0 interrupted iterations
default   [  50% ] 6000 VUs  00m54.8s/10m0s  301707/600000 shared iters

running (00m55.8s), 6000/6000 VUs, 308236 complete and 0 interrupted iterations
default   [  51% ] 6000 VUs  00m55.8s/10m0s  308236/600000 shared iters

running (00m56.8s), 6000/6000 VUs, 314838 complete and 0 interrupted iterations
default   [  52% ] 6000 VUs  00m56.8s/10m0s  314838/600000 shared iters

running (00m57.8s), 6000/6000 VUs, 320649 complete and 0 interrupted iterations
default   [  53% ] 6000 VUs  00m57.8s/10m0s  320649/600000 shared iters

running (00m58.8s), 6000/6000 VUs, 326817 complete and 0 interrupted iterations
default   [  54% ] 6000 VUs  00m58.8s/10m0s  326817/600000 shared iters

running (00m59.8s), 6000/6000 VUs, 333505 complete and 0 interrupted iterations
default   [  56% ] 6000 VUs  00m59.8s/10m0s  333505/600000 shared iters

running (01m00.8s), 6000/6000 VUs, 338634 complete and 0 interrupted iterations
default   [  56% ] 6000 VUs  01m00.8s/10m0s  338634/600000 shared iters

running (01m01.8s), 6000/6000 VUs, 343970 complete and 0 interrupted iterations
default   [  57% ] 6000 VUs  01m01.8s/10m0s  343970/600000 shared iters

running (01m02.8s), 6000/6000 VUs, 350083 complete and 0 interrupted iterations
default   [  58% ] 6000 VUs  01m02.8s/10m0s  350083/600000 shared iters

running (01m03.8s), 6000/6000 VUs, 355942 complete and 0 interrupted iterations
default   [  59% ] 6000 VUs  01m03.8s/10m0s  355942/600000 shared iters

running (01m04.8s), 6000/6000 VUs, 362538 complete and 0 interrupted iterations
default   [  60% ] 6000 VUs  01m04.8s/10m0s  362538/600000 shared iters

running (01m05.8s), 6000/6000 VUs, 369091 complete and 0 interrupted iterations
default   [  62% ] 6000 VUs  01m05.8s/10m0s  369091/600000 shared iters

running (01m06.8s), 6000/6000 VUs, 373524 complete and 0 interrupted iterations
default   [  62% ] 6000 VUs  01m06.8s/10m0s  373524/600000 shared iters

running (01m07.8s), 6000/6000 VUs, 379506 complete and 0 interrupted iterations
default   [  63% ] 6000 VUs  01m07.8s/10m0s  379506/600000 shared iters

running (01m08.8s), 6000/6000 VUs, 384945 complete and 0 interrupted iterations
default   [  64% ] 6000 VUs  01m08.8s/10m0s  384945/600000 shared iters

running (01m09.8s), 6000/6000 VUs, 389839 complete and 0 interrupted iterations
default   [  65% ] 6000 VUs  01m09.8s/10m0s  389839/600000 shared iters

running (01m10.8s), 6000/6000 VUs, 395300 complete and 0 interrupted iterations
default   [  66% ] 6000 VUs  01m10.8s/10m0s  395300/600000 shared iters

running (01m11.8s), 6000/6000 VUs, 401529 complete and 0 interrupted iterations
default   [  67% ] 6000 VUs  01m11.8s/10m0s  401529/600000 shared iters

running (01m12.8s), 6000/6000 VUs, 407809 complete and 0 interrupted iterations
default   [  68% ] 6000 VUs  01m12.8s/10m0s  407809/600000 shared iters

running (01m13.8s), 6000/6000 VUs, 413678 complete and 0 interrupted iterations
default   [  69% ] 6000 VUs  01m13.8s/10m0s  413678/600000 shared iters

running (01m14.8s), 6000/6000 VUs, 419703 complete and 0 interrupted iterations
default   [  70% ] 6000 VUs  01m14.8s/10m0s  419703/600000 shared iters

running (01m15.8s), 6000/6000 VUs, 425311 complete and 0 interrupted iterations
default   [  71% ] 6000 VUs  01m15.8s/10m0s  425311/600000 shared iters

running (01m16.8s), 6000/6000 VUs, 431093 complete and 0 interrupted iterations
default   [  72% ] 6000 VUs  01m16.8s/10m0s  431093/600000 shared iters

running (01m17.8s), 6000/6000 VUs, 436835 complete and 0 interrupted iterations
default   [  73% ] 6000 VUs  01m17.8s/10m0s  436835/600000 shared iters

running (01m18.8s), 6000/6000 VUs, 442638 complete and 0 interrupted iterations
default   [  74% ] 6000 VUs  01m18.8s/10m0s  442638/600000 shared iters

running (01m19.8s), 6000/6000 VUs, 448340 complete and 0 interrupted iterations
default   [  75% ] 6000 VUs  01m19.8s/10m0s  448340/600000 shared iters

running (01m20.8s), 6000/6000 VUs, 454802 complete and 0 interrupted iterations
default   [  76% ] 6000 VUs  01m20.8s/10m0s  454802/600000 shared iters

running (01m21.8s), 6000/6000 VUs, 461503 complete and 0 interrupted iterations
default   [  77% ] 6000 VUs  01m21.8s/10m0s  461503/600000 shared iters

running (01m22.8s), 6000/6000 VUs, 467504 complete and 0 interrupted iterations
default   [  78% ] 6000 VUs  01m22.8s/10m0s  467504/600000 shared iters

running (01m23.8s), 6000/6000 VUs, 472882 complete and 0 interrupted iterations
default   [  79% ] 6000 VUs  01m23.8s/10m0s  472882/600000 shared iters

running (01m24.8s), 6000/6000 VUs, 478741 complete and 0 interrupted iterations
default   [  80% ] 6000 VUs  01m24.8s/10m0s  478741/600000 shared iters

running (01m25.8s), 6000/6000 VUs, 484229 complete and 0 interrupted iterations
default   [  81% ] 6000 VUs  01m25.8s/10m0s  484229/600000 shared iters

running (01m26.8s), 6000/6000 VUs, 490248 complete and 0 interrupted iterations
default   [  82% ] 6000 VUs  01m26.8s/10m0s  490248/600000 shared iters

running (01m27.8s), 6000/6000 VUs, 495235 complete and 0 interrupted iterations
default   [  83% ] 6000 VUs  01m27.8s/10m0s  495235/600000 shared iters

running (01m28.8s), 6000/6000 VUs, 500209 complete and 0 interrupted iterations
default   [  83% ] 6000 VUs  01m28.8s/10m0s  500209/600000 shared iters

running (01m29.8s), 6000/6000 VUs, 503867 complete and 0 interrupted iterations
default   [  84% ] 6000 VUs  01m29.8s/10m0s  503867/600000 shared iters

running (01m30.8s), 6000/6000 VUs, 510146 complete and 0 interrupted iterations
default   [  85% ] 6000 VUs  01m30.8s/10m0s  510146/600000 shared iters

running (01m31.8s), 6000/6000 VUs, 516343 complete and 0 interrupted iterations
default   [  86% ] 6000 VUs  01m31.8s/10m0s  516343/600000 shared iters

running (01m32.8s), 6000/6000 VUs, 522448 complete and 0 interrupted iterations
default   [  87% ] 6000 VUs  01m32.8s/10m0s  522448/600000 shared iters

running (01m33.8s), 6000/6000 VUs, 527765 complete and 0 interrupted iterations
default   [  88% ] 6000 VUs  01m33.8s/10m0s  527765/600000 shared iters

running (01m34.8s), 6000/6000 VUs, 533675 complete and 0 interrupted iterations
default   [  89% ] 6000 VUs  01m34.8s/10m0s  533675/600000 shared iters

running (01m35.8s), 6000/6000 VUs, 539600 complete and 0 interrupted iterations
default   [  90% ] 6000 VUs  01m35.8s/10m0s  539600/600000 shared iters

running (01m36.8s), 6000/6000 VUs, 545806 complete and 0 interrupted iterations
default   [  91% ] 6000 VUs  01m36.8s/10m0s  545806/600000 shared iters

running (01m37.8s), 6000/6000 VUs, 551332 complete and 0 interrupted iterations
default   [  92% ] 6000 VUs  01m37.8s/10m0s  551332/600000 shared iters

running (01m38.8s), 6000/6000 VUs, 557466 complete and 0 interrupted iterations
default   [  93% ] 6000 VUs  01m38.8s/10m0s  557466/600000 shared iters

running (01m39.8s), 6000/6000 VUs, 562523 complete and 0 interrupted iterations
default   [  94% ] 6000 VUs  01m39.8s/10m0s  562523/600000 shared iters

running (01m40.8s), 6000/6000 VUs, 568381 complete and 0 interrupted iterations
default   [  95% ] 6000 VUs  01m40.8s/10m0s  568381/600000 shared iters

running (01m41.8s), 6000/6000 VUs, 574360 complete and 0 interrupted iterations
default   [  96% ] 6000 VUs  01m41.8s/10m0s  574360/600000 shared iters

running (01m42.8s), 6000/6000 VUs, 580781 complete and 0 interrupted iterations
default   [  97% ] 6000 VUs  01m42.8s/10m0s  580781/600000 shared iters

running (01m43.8s), 6000/6000 VUs, 586710 complete and 0 interrupted iterations
default   [  98% ] 6000 VUs  01m43.8s/10m0s  586710/600000 shared iters

running (01m44.8s), 6000/6000 VUs, 592373 complete and 0 interrupted iterations
default   [  99% ] 6000 VUs  01m44.8s/10m0s  592373/600000 shared iters

running (01m45.8s), 1693/6000 VUs, 598307 complete and 0 interrupted iterations
default   [ 100% ] 6000 VUs  01m45.8s/10m0s  598307/600000 shared iters

     data_received..................: 68 MB  639 kB/s
     data_sent......................: 52 MB  492 kB/s
     http_req_blocked...............: avg=7.45ms  min=0s     med=1µs   max=3.04s   p(90)=2µs   p(95)=3µs  
     http_req_connecting............: avg=7.44ms  min=0s     med=0s    max=3s      p(90)=0s    p(95)=0s   
     http_req_duration..............: avg=1.04s   min=6.51ms med=1.01s max=5.57s   p(90)=1.24s p(95)=1.31s
       { expected_response:true }...: avg=1.04s   min=6.51ms med=1.01s max=5.57s   p(90)=1.24s p(95)=1.31s
     http_req_failed................: 0.00%  ✓ 0           ✗ 600000
     http_req_receiving.............: avg=21.22µs min=4µs    med=14µs  max=6.51ms  p(90)=30µs  p(95)=44µs 
     http_req_sending...............: avg=22.98µs min=1µs    med=5µs   max=43.09ms p(90)=9µs   p(95)=15µs 
     http_req_tls_handshaking.......: avg=0s      min=0s     med=0s    max=0s      p(90)=0s    p(95)=0s   
     http_req_waiting...............: avg=1.04s   min=6.49ms med=1.01s max=5.57s   p(90)=1.24s p(95)=1.31s
     http_reqs......................: 600000 5658.099653/s
     iteration_duration.............: avg=1.05s   min=6.59ms med=1.01s max=5.77s   p(90)=1.24s p(95)=1.31s
     iterations.....................: 600000 5658.099653/s
     vus............................: 1693   min=1693      max=6000
     vus_max........................: 6000   min=6000      max=6000


running (01m46.0s), 0000/6000 VUs, 600000 complete and 0 interrupted iterations
default ✓ [ 100% ] 6000 VUs  01m46.0s/10m0s  600000/600000 shared iters